<?php
return [
//    薪水范围；
    'salary' => [
        1 => '面议',
        2 => '2K以下',
        3 => '2K-3K',
        4 => '3K-4K',
        5 => '4K-5K',
        6 => '5K-7K',
        7 => '7K-10K',
        8 => '10K-15K',
        9 => '15K-20K',
        10 => '20K-50K',
        11 => '50K-100K',
        12 => '100K以上',
    ],

    //工作经验
    'experience' => [
        0 => '不限',
        1 => '在读学生',
        2 => '应届毕业生',
        3 => '一年以内',
        4 => '一年以上',
        5 => '两年以上',
        6 => '三年以上',
        7 => '五年以上',
        8 => '八年以上',
        9 => '十年以上',
        10 => '二十年以上',
        11 => '退休人员',
    ],

    //学历要求
    'education' => [
        0 => '不限',
        1 => '大专',
        2 => '本科',
        3 => '硕士',
        4 => '博士',
        5 => '博士后',
        6 => 'MBA',
        7 => 'EMBA',
        8 => '中专',
        9 => '高中',
        10 => '初中',
    ],

    //公司性质
    'type' => [
        1 => '政府机关',
        2 => '失业单位',
        3 => '国有企业',
        4 => '外商融资',
        5 => '中外合资',
        6 => '民营企业',
        7 => '上市公司',
        8 => '创业公司',
        9 => '其他',
    ],

    'scale' => [
        1 => '少于10人',
        2 => '10-49人',
        3 => '50-99人',
        4 => '100-249人',
        5 => '250-499人',
        6 => '500-999人',
        7 => '1000-4999人',
        8 => '4999-10000人',
        9 => '10000+',
    ],

//    整治面貌
    'politicalstatus' => [
        1 => '群众',
        2 => '中共党员',
        3 => '共青团员',
        4 => '民主党派',
    ],
//    婚姻状态
    'marriage' => [
        1 => '未婚',
        2 => '已婚',
        3 => '已婚已育',
    ],

//  求职性质、
    'nature' => [
        1 => '不选',
        2 => '全职',
        3 => '兼职',
        4 => '实习',
    ],

    'status' => [
        1 => '正在找工作',
        2 => '在职观望好机会',
        3 => '在职不找工作',
    ],

    'english' => [
        1 => '一般',
        2 => '良好',
        3 => '熟练',
        4 => '精通',
    ],
    'language' => [
        1 => '英语',
        2 => '德语',
        3 => '日语',
        4 => '法语',
        5 => '俄语',
        6 => '西班牙语',
        7 => '朝鲜语',
        8 => '阿拉伯语',
        9 => '波斯语',
        10 => '印尼语',
        11 => '印地语',
        12 => '马来语',
        13 => '蒙古语',
        14 => '泰语',
        15 => '葡萄牙语',
        16 => '土耳语',
        17 => '意大利语',
        18 => '粤语',
        19 => '普通话',
        20 => '其他',
    ],

//    婚恋配置；
    'sex' => [
        1 => '男',
        2 => '女',
    ],

    'children' => [
        0 => '不限',
        1 => '视情况而定',
        2 => '想要孩子',
        3 => '不想要孩子',
        4 => '以后再告诉你',
    ],

    'want_child' => [
        0 => '不限',
        1 => '没有小孩',
        2 => '有孩子且住在一起',
        3 => '有孩子偶尔住在一起',
        4 => '有孩子不在身边',
    ],

    'posture' => [
        0 => '保密',
        1 => '一般',
        2 => '瘦长',
        3 => '苗条',
        4 => '高大美丽',
        5 => '丰满',
        6 => '富线条美',
    ],

    'marriage_love' => [
        0 => '不限',
        1 => '离异',
        2 => '丧偶',
        3 => '未婚',

    ],
    'constellation' => [
        1 => '水瓶座(12.22-01.19)',
        2 => '双鱼座(02.20-03.20)',
        3 => '牡羊座(3.21-4.20)',
        4 => '金牛座(04.21-05.20)',
        5 => '双子座(05.21-06.21)',
        6 => '巨蟹座(06.22-07.22)',
        7 => '狮子座(07.23-08.23)',
        8 => '处女座(08.23-09.22)',
        9 => '天枰座(09.23-10.22)',
        10 => '天蝎座(10.23-11.21)',
        11 => '射手座(11.22-12.21)',
        12 => '摩羯座(12.22-01.19)',
    ],


    'salary_lvoe' => [
        0 =>  '不限',
        1 =>  '2000元以下',
        2 =>  '2000-3000元',
        3 =>  '3000-4000元',
        4 =>  '4000-5000元',
        5 =>  '5000-7000元',
        6 =>  '7000-10000元',
        7 =>  '10000-14999元',
        8 => '15000-19999元',
        9 => '20000-50000元',
        10 => '50000-100000元',
        11 => '100000元以上'
    ],

    'marry' => [
        1 => '认同闪婚',
        2 => '一年内',
        3 => '两年内',
        4 => '三年内',
        5 => '时机成熟就闪婚',

    ],
];